content/man/man1/git-status.1.org
#+TITLE: Manpages - git-status.1
* NAME
git-status - Show the working tree status

* SYNOPSIS
#+begin_example
git status [<options>] [--] [<pathspec>...]
#+end_example

* DESCRIPTION
Displays paths that have differences between the index file and the
current HEAD commit, paths that have differences between the working
tree and the index file, and paths in the working tree that are not
tracked by Git (and are not ignored by *gitignore*(5)). The first are
what you /would/ commit by running *git commit*; the second and third
are what you /could/ commit by running /git add/ before running *git
commit*.

* OPTIONS
-s, --short

#+begin_quote
Give the output in the short-format.

#+end_quote

-b, --branch

#+begin_quote
Show the branch and tracking info even in short-format.

#+end_quote

--show-stash

#+begin_quote
Show the number of entries currently stashed away.

#+end_quote

--porcelain[=<version>]

#+begin_quote
Give the output in an easy-to-parse format for scripts. This is similar
to the short output, but will remain stable across Git versions and
regardless of user configuration. See below for details.

The version parameter is used to specify the format version. This is
optional and defaults to the original version /v1/ format.

#+end_quote

--long

#+begin_quote
Give the output in the long-format. This is the default.

#+end_quote

-v, --verbose

#+begin_quote
In addition to the names of files that have been changed, also show the
textual changes that are staged to be committed (i.e., like the output
of *git diff --cached*). If *-v* is specified twice, then also show the
changes in the working tree that have not yet been staged (i.e., like
the output of *git diff*).

#+end_quote

-u[<mode>], --untracked-files[=<mode>]

#+begin_quote
Show untracked files.

The mode parameter is used to specify the handling of untracked files.
It is optional: it defaults to /all/, and if specified, it must be stuck
to the option (e.g. *-uno*, but not *-u no*).

The possible options are:

#+begin_quote
·

/no/ - Show no untracked files.

#+end_quote

#+begin_quote
·

/normal/ - Shows untracked files and directories.

#+end_quote

#+begin_quote
·

/all/ - Also shows individual files in untracked directories.

#+end_quote

When *-u* option is not used, untracked files and directories are shown
(i.e. the same as specifying *normal*), to help you avoid forgetting to
add newly created files. Because it takes extra work to find untracked
files in the filesystem, this mode may take some time in a large working
tree. Consider enabling untracked cache and split index if supported
(see *git update-index --untracked-cache* and *git update-index
--split-index*), Otherwise you can use *no* to have *git status* return
more quickly without showing untracked files. All usual spellings for
Boolean value *true* are taken as *normal* and *false* as *no*.

The default can be changed using the status.showUntrackedFiles
configuration variable documented in *git-config*(1).

#+end_quote

--ignore-submodules[=<when>]

#+begin_quote
Ignore changes to submodules when looking for changes. <when> can be
either "none", "untracked", "dirty" or "all", which is the default.
Using "none" will consider the submodule modified when it either
contains untracked or modified files or its HEAD differs from the commit
recorded in the superproject and can be used to override any settings of
the /ignore/ option in *git-config*(1) or *gitmodules*(5). When
"untracked" is used submodules are not considered dirty when they only
contain untracked content (but they are still scanned for modified
content). Using "dirty" ignores all changes to the work tree of
submodules, only changes to the commits stored in the superproject are
shown (this was the behavior before 1.7.0). Using "all" hides all
changes to submodules (and suppresses the output of submodule summaries
when the config option *status.submoduleSummary* is set).

#+end_quote

--ignored[=<mode>]

#+begin_quote
Show ignored files as well.

The mode parameter is used to specify the handling of ignored files. It
is optional: it defaults to /traditional/.

The possible options are:

#+begin_quote
·

/traditional/ - Shows ignored files and directories, unless
--untracked-files=all is specified, in which case individual files in
ignored directories are displayed.

#+end_quote

#+begin_quote
·

/no/ - Show no ignored files.

#+end_quote

#+begin_quote
·

/matching/ - Shows ignored files and directories matching an ignore
pattern.

#+end_quote

When /matching/ mode is specified, paths that explicitly match an
ignored pattern are shown. If a directory matches an ignore pattern,
then it is shown, but not paths contained in the ignored directory. If a
directory does not match an ignore pattern, but all contents are
ignored, then the directory is not shown, but all contents are shown.

#+end_quote

-z

#+begin_quote
Terminate entries with NUL, instead of LF. This implies the
*--porcelain=v1* output format if no other format is given.

#+end_quote

--column[=<options>], --no-column

#+begin_quote
Display untracked files in columns. See configuration variable
*column.status* for option syntax. *--column* and *--no-column* without
options are equivalent to /always/ and /never/ respectively.

#+end_quote

--ahead-behind, --no-ahead-behind

#+begin_quote
Display or do not display detailed ahead/behind counts for the branch
relative to its upstream branch. Defaults to true.

#+end_quote

--renames, --no-renames

#+begin_quote
Turn on/off rename detection regardless of user configuration. See also
*git-diff*(1) *--no-renames*.

#+end_quote

--find-renames[=<n>]

#+begin_quote
Turn on rename detection, optionally setting the similarity threshold.
See also *git-diff*(1) *--find-renames*.

#+end_quote

<pathspec>...

#+begin_quote
See the /pathspec/ entry in *gitglossary*(7).

#+end_quote

* OUTPUT
The output from this command is designed to be used as a commit template
comment. The default, long format, is designed to be human readable,
verbose and descriptive. Its contents and format are subject to change
at any time.

The paths mentioned in the output, unlike many other Git commands, are
made relative to the current directory if you are working in a
subdirectory (this is on purpose, to help cutting and pasting). See the
status.relativePaths config option below.

