public/man/man1/git-status.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-status.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-status.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-status - Show the working tree status</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git status [&lt;options&gt;] [--] [&lt;pathspec&gt;...]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Displays paths that have differences between the index file and the
current HEAD commit, paths that have differences between the working
tree and the index file, and paths in the working tree that are not
tracked by Git (and are not ignored by <strong>gitignore*(5)). The first are
what you <em>would</em> commit by running *git commit</strong>; the second and third
are what you <em>could</em> commit by running <em>git add</em> before running <strong>git
commit</strong>.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-s, –short</p>
<blockquote>
<p>Give the output in the short-format.</p>
</blockquote>
<p>
-b, –branch</p>
<blockquote>
<p>Show the branch and tracking info even in short-format.</p>
</blockquote>
<p>
–show-stash</p>
<blockquote>
<p>Show the number of entries currently stashed away.</p>
</blockquote>
<p>
–porcelain[=&lt;version&gt;]</p>
<blockquote>
<p>Give the output in an easy-to-parse format for scripts. This is similar
to the short output, but will remain stable across Git versions and
regardless of user configuration. See below for details.</p>
<p>
The version parameter is used to specify the format version. This is
optional and defaults to the original version <em>v1</em> format.</p>
</blockquote>
<p>
–long</p>
<blockquote>
<p>Give the output in the long-format. This is the default.</p>
</blockquote>
<p>
-v, –verbose</p>
<blockquote>
<p>In addition to the names of files that have been changed, also show the
textual changes that are staged to be committed (i.e., like the output
of <strong>git diff –cached</strong>). If <strong>-v</strong> is specified twice, then also show the
changes in the working tree that have not yet been staged (i.e., like
the output of <strong>git diff</strong>).</p>
</blockquote>
<p>
-u[&lt;mode&gt;], –untracked-files[=&lt;mode&gt;]</p>
<blockquote>
<p>Show untracked files.</p>
<p>
The mode parameter is used to specify the handling of untracked files.
It is optional: it defaults to <em>all</em>, and if specified, it must be stuck
to the option (e.g. <strong>-uno</strong>, but not <strong>-u no</strong>).</p>
<p>
The possible options are:</p>
<blockquote>
<p>·</p>
<p>
<em>no</em> - Show no untracked files.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>normal</em> - Shows untracked files and directories.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>all</em> - Also shows individual files in untracked directories.</p>
</blockquote>
<p>
When <strong>-u</strong> option is not used, untracked files and directories are shown
(i.e. the same as specifying <strong>normal</strong>), to help you avoid forgetting to
add newly created files. Because it takes extra work to find untracked
files in the filesystem, this mode may take some time in a large working
tree. Consider enabling untracked cache and split index if supported
(see <strong>git update-index –untracked-cache</strong> and <strong>git update-index
–split-index</strong>), Otherwise you can use <strong>no</strong> to have <strong>git status</strong> return
more quickly without showing untracked files. All usual spellings for
Boolean value <strong>true</strong> are taken as <strong>normal</strong> and <strong>false</strong> as <strong>no</strong>.</p>
<p>
The default can be changed using the status.showUntrackedFiles
configuration variable documented in *git-config*(1).</p>
</blockquote>
<p>
–ignore-submodules[=&lt;when&gt;]</p>
<blockquote>
<p>Ignore changes to submodules when looking for changes. &lt;when&gt; can be
either &#34;none&#34;, &#34;untracked&#34;, &#34;dirty&#34; or &#34;all&#34;, which is the default.
Using &#34;none&#34; will consider the submodule modified when it either
contains untracked or modified files or its HEAD differs from the commit
recorded in the superproject and can be used to override any settings of
the <em>ignore</em> option in *git-config*(1) or *gitmodules*(5). When
&#34;untracked&#34; is used submodules are not considered dirty when they only
contain untracked content (but they are still scanned for modified
content). Using &#34;dirty&#34; ignores all changes to the work tree of
submodules, only changes to the commits stored in the superproject are
shown (this was the behavior before 1.7.0). Using &#34;all&#34; hides all
changes to submodules (and suppresses the output of submodule summaries
when the config option <strong>status.submoduleSummary</strong> is set).</p>
</blockquote>
<p>
–ignored[=&lt;mode&gt;]</p>
<blockquote>
<p>Show ignored files as well.</p>
<p>
The mode parameter is used to specify the handling of ignored files. It
is optional: it defaults to <em>traditional</em>.</p>
<p>
The possible options are:</p>
<blockquote>
<p>·</p>
<p>
<em>traditional</em> - Shows ignored files and directories, unless
–untracked-files=all is specified, in which case individual files in
ignored directories are displayed.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>no</em> - Show no ignored files.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>matching</em> - Shows ignored files and directories matching an ignore
pattern.</p>
</blockquote>
<p>
When <em>matching</em> mode is specified, paths that explicitly match an
ignored pattern are shown. If a directory matches an ignore pattern,
then it is shown, but not paths contained in the ignored directory. If a
directory does not match an ignore pattern, but all contents are
ignored, then the directory is not shown, but all contents are shown.</p>
</blockquote>
<p>
-z</p>
<blockquote>
<p>Terminate entries with NUL, instead of LF. This implies the
<strong>–porcelain=v1</strong> output format if no other format is given.</p>
</blockquote>
<p>
–column[=&lt;options&gt;], –no-column</p>
<blockquote>
<p>Display untracked files in columns. See configuration variable
<strong>column.status</strong> for option syntax. <strong>–column</strong> and <strong>–no-column</strong> without
options are equivalent to <em>always</em> and <em>never</em> respectively.</p>
</blockquote>
<p>
–ahead-behind, –no-ahead-behind</p>
<blockquote>
<p>Display or do not display detailed ahead/behind counts for the branch
relative to its upstream branch. Defaults to true.</p>
</blockquote>
<p>
–renames, –no-renames</p>
<blockquote>
<p>Turn on/off rename detection regardless of user configuration. See also
<strong>git-diff*(1) *–no-renames</strong>.</p>
</blockquote>
<p>
–find-renames[=&lt;n&gt;]</p>
<blockquote>
<p>Turn on rename detection, optionally setting the similarity threshold.
See also <strong>git-diff*(1) *–find-renames</strong>.</p>
</blockquote>
<p>
&lt;pathspec&gt;…</p>
<blockquote>
<p>See the <em>pathspec</em> entry in *gitglossary*(7).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
OUTPUT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The output from this command is designed to be used as a commit template
comment. The default, long format, is designed to be human readable,
verbose and descriptive. Its contents and format are subject to change
at any time.</p>
<p>
The paths mentioned in the output, unlike many other Git commands, are
made relative to the current directory if you are working in a
subdirectory (this is on purpose, to help cutting and pasting). See the
status.relativePaths config option below.</p>
