public/man/man1/git-status.1/index.html
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Short Format
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>In the short-format, the status of each path is shown as one of these
forms</p>
<blockquote>
<pre class="example">
XY PATH
XY ORIG_PATH -&gt; PATH
</pre>
</blockquote>
<p>
where <strong>ORIG_PATH</strong> is where the renamed/copied contents came from.
<strong>ORIG_PATH</strong> is only shown when the entry is renamed or copied. The <strong>XY</strong>
is a two-letter status code.</p>
<p>
The fields (including the <strong>-&gt;</strong>) are separated from each other by a
single space. If a filename contains whitespace or other nonprintable
characters, that field will be quoted in the manner of a C string
literal: surrounded by ASCII double quote (34) characters, and with
interior special characters backslash-escaped.</p>
<p>
There are three different types of states that are shown using this
format, and each one uses the <strong>XY</strong> syntax differently:</p>
<blockquote>
<p>·</p>
<p>
When a merge is occurring and the merge was successful, or outside of a
merge situation, <strong>X</strong> shows the status of the index and <strong>Y</strong> shows the
status of the working tree.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
When a merge conflict has occurred and has not yet been resolved, <strong>X</strong>
and <strong>Y</strong> show the state introduced by each head of the merge, relative to
the common ancestor. These paths are said to be <em>unmerged</em>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
When a path is untracked, <strong>X</strong> and <strong>Y</strong> are always the same, since they
are unknown to the index. <strong>??</strong> is used for untracked paths. Ignored
files are not listed unless <strong>–ignored</strong> is used; if it is, ignored files
are indicated by <strong>!!</strong>.</p>
</blockquote>
<p>
Note that the term <em>merge</em> here also includes rebases using the default
<strong>–merge</strong> strategy, cherry-picks, and anything else using the merge
machinery.</p>
<p>
In the following table, these three classes are shown in separate
sections, and these characters are used for <strong>X</strong> and <strong>Y</strong> fields for the
first two sections that show tracked paths:</p>
<blockquote>
<p>·</p>
<p>
= unmodified</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>M</em> = modified</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>T</em> = file type changed (regular file, symbolic link or submodule)</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>A</em> = added</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>D</em> = deleted</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>R</em> = renamed</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>C</em> = copied (if config option status.renames is set to &#34;copies&#34;)</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>U</em> = updated but unmerged</p>
</blockquote>
<blockquote>
<pre class="example">
X          Y     Meaning
-------------------------------------------------
         [AMD]   not updated
M        [ MTD]  updated in index
T        [ MTD]  type changed in index
A        [ MTD]  added to index
D                deleted from index
R        [ MTD]  renamed in index
C        [ MTD]  copied in index
[MTARC]          index and work tree matches
[ MTARC]    M    work tree changed since index
[ MTARC]    T    type changed in work tree since index
[ MTARC]    D    deleted in work tree
            R    renamed in work tree
            C    copied in work tree
-------------------------------------------------
D           D    unmerged, both deleted
A           U    unmerged, added by us
U           D    unmerged, deleted by them
U           A    unmerged, added by them
D           U    unmerged, deleted by us
A           A    unmerged, both added
U           U    unmerged, both modified
-------------------------------------------------
?           ?    untracked
!           !    ignored
-------------------------------------------------
</pre>
</blockquote>
<p>
Submodules have more state and instead report</p>
<blockquote>
<p>·</p>
<p>
<em>M</em> = the submodule has a different HEAD than recorded in the index</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>m</em> = the submodule has modified content</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>?</em> = the submodule has untracked files</p>
</blockquote>
<p>
This is since modified content or untracked files in a submodule cannot
be added via <strong>git add</strong> in the superproject to prepare a commit.</p>
<p>
<em>m</em> and <em>?</em> are applied recursively. For example if a nested submodule
in a submodule contains an untracked file, this is reported as <em>?</em> as
well.</p>
<p>
If -b is used the short-format status is preceded by a line</p>
<blockquote>
<pre class="example">
## branchname tracking info
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Porcelain Format Version 1
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Version 1 porcelain format is similar to the short format, but is
guaranteed not to change in a backwards-incompatible way between Git
versions or based on user configuration. This makes it ideal for parsing
by scripts. The description of the short format above also describes the
porcelain format, with a few exceptions:</p>
<blockquote>
<ol>
<li></li>
</ol>
<p>The user&#39;s color.status configuration is not respected; color will
always be off.</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>The user&#39;s status.relativePaths configuration is not respected; paths
shown will always be relative to the repository root.</p>
</blockquote>
<p>
There is also an alternate -z format recommended for machine parsing. In
that format, the status field is the same, but some other things change.
First, the <em>-&gt;</em> is omitted from rename entries and the field order is
reversed (e.g <em>from -&gt; to</em> becomes <em>to from</em>). Second, a NUL (ASCII 0)
follows each filename, replacing space as a field separator and the
terminating newline (but a space still separates the status field from
the first filename). Third, filenames containing special characters are
not specially formatted; no quoting or backslash-escaping is performed.</p>
<p>
Any submodule changes are reported as modified <strong>M</strong> instead of <strong>m</strong> or
single <strong>?</strong>.</p>
</div>
</div>
