content/man/man1/git-status.1.org
** Porcelain Format Version 2
Version 2 format adds more detailed information about the state of the
worktree and changed items. Version 2 also defines an extensible set of
easy to parse optional headers.

Header lines start with "#" and are added in response to specific
command line arguments. Parsers should ignore headers they don't
recognize.

\\

*Branch Headers*

#+begin_quote
If *--branch* is given, a series of header lines are printed with
information about the current branch.

#+begin_quote
#+begin_example
Line                                     Notes
------------------------------------------------------------
# branch.oid <commit> | (initial)        Current commit.
# branch.head <branch> | (detached)      Current branch.
# branch.upstream <upstream-branch>      If upstream is set.
# branch.ab +<ahead> -<behind>           If upstream is set and
                                         the commit is present.
------------------------------------------------------------
#+end_example

#+end_quote

#+end_quote

\\

*Stash Information*

#+begin_quote
If *--show-stash* is given, one line is printed showing the number of
stash entries if non-zero:

#+begin_quote
#+begin_example
# stash <N>
#+end_example

#+end_quote

#+end_quote

\\

*Changed Tracked Entries*

#+begin_quote
Following the headers, a series of lines are printed for tracked
entries. One of three different line formats may be used to describe an
entry depending on the type of change. Tracked entries are printed in an
undefined order; parsers should allow for a mixture of the 3 line types
in any order.

Ordinary changed entries have the following format:

#+begin_quote
#+begin_example
1 <XY> <sub> <mH> <mI> <mW> <hH> <hI> <path>
#+end_example

#+end_quote

Renamed or copied entries have the following format:

#+begin_quote
#+begin_example
2 <XY> <sub> <mH> <mI> <mW> <hH> <hI> <X><score> <path><sep><origPath>
#+end_example

#+end_quote

#+begin_quote
#+begin_example
Field       Meaning
--------------------------------------------------------
<XY>        A 2 character field containing the staged and
            unstaged XY values described in the short format,
            with unchanged indicated by a "." rather than
            a space.
<sub>       A 4 character field describing the submodule state.
            "N..." when the entry is not a submodule.
            "S<c><m><u>" when the entry is a submodule.
            <c> is "C" if the commit changed; otherwise ".".
            <m> is "M" if it has tracked changes; otherwise ".".
            <u> is "U" if there are untracked changes; otherwise ".".
<mH>        The octal file mode in HEAD.
<mI>        The octal file mode in the index.
<mW>        The octal file mode in the worktree.
<hH>        The object name in HEAD.
<hI>        The object name in the index.
<X><score>  The rename or copy score (denoting the percentage
            of similarity between the source and target of the
            move or copy). For example "R100" or "C75".
<path>      The pathname.  In a renamed/copied entry, this
            is the target path.
<sep>       When the `-z` option is used, the 2 pathnames are separated
            with a NUL (ASCII 0x00) byte; otherwise, a tab (ASCII 0x09)
            byte separates them.
<origPath>  The pathname in the commit at HEAD or in the index.
            This is only present in a renamed/copied entry, and
            tells where the renamed/copied contents came from.
--------------------------------------------------------
#+end_example

#+end_quote

Unmerged entries have the following format; the first character is a "u"
to distinguish from ordinary changed entries.

#+begin_quote
#+begin_example
u <XY> <sub> <m1> <m2> <m3> <mW> <h1> <h2> <h3> <path>
#+end_example

#+end_quote

#+begin_quote
#+begin_example
Field       Meaning
--------------------------------------------------------
<XY>        A 2 character field describing the conflict type
            as described in the short format.
<sub>       A 4 character field describing the submodule state
            as described above.
<m1>        The octal file mode in stage 1.
<m2>        The octal file mode in stage 2.
<m3>        The octal file mode in stage 3.
<mW>        The octal file mode in the worktree.
<h1>        The object name in stage 1.
<h2>        The object name in stage 2.
<h3>        The object name in stage 3.
<path>      The pathname.
--------------------------------------------------------
#+end_example

#+end_quote

#+end_quote

\\

*Other Items*

#+begin_quote
Following the tracked entries (and if requested), a series of lines will
be printed for untracked and then ignored items found in the worktree.

Untracked items have the following format:

#+begin_quote
#+begin_example
? <path>
#+end_example

#+end_quote

Ignored items have the following format:

#+begin_quote
#+begin_example
! <path>
#+end_example

#+end_quote

#+end_quote

\\

*Pathname Format Notes and -z*

#+begin_quote
When the *-z* option is given, pathnames are printed as is and without
any quoting and lines are terminated with a NUL (ASCII 0x00) byte.

Without the *-z* option, pathnames with "unusual" characters are quoted
as explained for the configuration variable *core.quotePath* (see
*git-config*(1)).

#+end_quote

* CONFIGURATION
The command honors *color.status* (or *status.color* --- they mean the
same thing and the latter is kept for backward compatibility) and
*color.status.<slot>* configuration variables to colorize its output.

If the config variable *status.relativePaths* is set to false, then all
paths shown are relative to the repository root, not to the current
directory.

If *status.submoduleSummary* is set to a non zero number or true
(identical to -1 or an unlimited number), the submodule summary will be
enabled for the long format and a summary of commits for modified
submodules will be shown (see --summary-limit option of
*git-submodule*(1)). Please note that the summary output from the status
command will be suppressed for all submodules when
*diff.ignoreSubmodules* is set to /all/ or only for those submodules
where *submodule.<name>.ignore=all*. To also view the summary for
ignored submodules you can either use the --ignore-submodules=dirty
command line option or the /git submodule summary/ command, which shows
a similar output but does not honor these settings.

* BACKGROUND REFRESH
By default, *git status* will automatically refresh the index, updating
the cached stat information from the working tree and writing out the
result. Writing out the updated index is an optimization that isn't
strictly necessary (*status* computes the values for itself, but writing
them out is just to save subsequent programs from repeating our
computation). When *status* is run in the background, the lock held
during the write may conflict with other simultaneous processes, causing
them to fail. Scripts running *status* in the background should consider
using *git --no-optional-locks status* (see *git*(1) for details).

