public/man/man1/git-status.1/index.html
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Porcelain Format Version 2
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Version 2 format adds more detailed information about the state of the
worktree and changed items. Version 2 also defines an extensible set of
easy to parse optional headers.</p>
<p>
Header lines start with &#34;#&#34; and are added in response to specific
command line arguments. Parsers should ignore headers they don&#39;t
recognize.</p>
<p>
\\</p>
<p>
<strong>Branch Headers</strong></p>
<blockquote>
<p>If <strong>–branch</strong> is given, a series of header lines are printed with
information about the current branch.</p>
<blockquote>
<pre class="example">
Line                                     Notes
------------------------------------------------------------
# branch.oid &lt;commit&gt; | (initial)        Current commit.
# branch.head &lt;branch&gt; | (detached)      Current branch.
# branch.upstream &lt;upstream-branch&gt;      If upstream is set.
# branch.ab +&lt;ahead&gt; -&lt;behind&gt;           If upstream is set and
                                         the commit is present.
------------------------------------------------------------
</pre>
</blockquote>
</blockquote>
<p>
\\</p>
<p>
<strong>Stash Information</strong></p>
<blockquote>
<p>If <strong>–show-stash</strong> is given, one line is printed showing the number of
stash entries if non-zero:</p>
<blockquote>
<pre class="example">
# stash &lt;N&gt;
</pre>
</blockquote>
</blockquote>
<p>
\\</p>
<p>
<strong>Changed Tracked Entries</strong></p>
<blockquote>
<p>Following the headers, a series of lines are printed for tracked
entries. One of three different line formats may be used to describe an
entry depending on the type of change. Tracked entries are printed in an
undefined order; parsers should allow for a mixture of the 3 line types
in any order.</p>
<p>
Ordinary changed entries have the following format:</p>
<blockquote>
<pre class="example">
1 &lt;XY&gt; &lt;sub&gt; &lt;mH&gt; &lt;mI&gt; &lt;mW&gt; &lt;hH&gt; &lt;hI&gt; &lt;path&gt;
</pre>
</blockquote>
<p>
Renamed or copied entries have the following format:</p>
<blockquote>
<pre class="example">
2 &lt;XY&gt; &lt;sub&gt; &lt;mH&gt; &lt;mI&gt; &lt;mW&gt; &lt;hH&gt; &lt;hI&gt; &lt;X&gt;&lt;score&gt; &lt;path&gt;&lt;sep&gt;&lt;origPath&gt;
</pre>
</blockquote>
<blockquote>
<pre class="example">
Field       Meaning
--------------------------------------------------------
&lt;XY&gt;        A 2 character field containing the staged and
            unstaged XY values described in the short format,
            with unchanged indicated by a &#34;.&#34; rather than
            a space.
&lt;sub&gt;       A 4 character field describing the submodule state.
            &#34;N...&#34; when the entry is not a submodule.
            &#34;S&lt;c&gt;&lt;m&gt;&lt;u&gt;&#34; when the entry is a submodule.
            &lt;c&gt; is &#34;C&#34; if the commit changed; otherwise &#34;.&#34;.
            &lt;m&gt; is &#34;M&#34; if it has tracked changes; otherwise &#34;.&#34;.
            &lt;u&gt; is &#34;U&#34; if there are untracked changes; otherwise &#34;.&#34;.
&lt;mH&gt;        The octal file mode in HEAD.
&lt;mI&gt;        The octal file mode in the index.
&lt;mW&gt;        The octal file mode in the worktree.
&lt;hH&gt;        The object name in HEAD.
&lt;hI&gt;        The object name in the index.
&lt;X&gt;&lt;score&gt;  The rename or copy score (denoting the percentage
            of similarity between the source and target of the
            move or copy). For example &#34;R100&#34; or &#34;C75&#34;.
&lt;path&gt;      The pathname.  In a renamed/copied entry, this
            is the target path.
&lt;sep&gt;       When the `-z` option is used, the 2 pathnames are separated
            with a NUL (ASCII 0x00) byte; otherwise, a tab (ASCII 0x09)
            byte separates them.
&lt;origPath&gt;  The pathname in the commit at HEAD or in the index.
            This is only present in a renamed/copied entry, and
            tells where the renamed/copied contents came from.
--------------------------------------------------------
</pre>
</blockquote>
<p>
Unmerged entries have the following format; the first character is a &#34;u&#34;
to distinguish from ordinary changed entries.</p>
<blockquote>
<pre class="example">
u &lt;XY&gt; &lt;sub&gt; &lt;m1&gt; &lt;m2&gt; &lt;m3&gt; &lt;mW&gt; &lt;h1&gt; &lt;h2&gt; &lt;h3&gt; &lt;path&gt;
</pre>
</blockquote>
<blockquote>
<pre class="example">
Field       Meaning
--------------------------------------------------------
&lt;XY&gt;        A 2 character field describing the conflict type
            as described in the short format.
&lt;sub&gt;       A 4 character field describing the submodule state
            as described above.
&lt;m1&gt;        The octal file mode in stage 1.
&lt;m2&gt;        The octal file mode in stage 2.
&lt;m3&gt;        The octal file mode in stage 3.
&lt;mW&gt;        The octal file mode in the worktree.
&lt;h1&gt;        The object name in stage 1.
&lt;h2&gt;        The object name in stage 2.
&lt;h3&gt;        The object name in stage 3.
&lt;path&gt;      The pathname.
--------------------------------------------------------
</pre>
</blockquote>
</blockquote>
<p>
\\</p>
<p>
<strong>Other Items</strong></p>
<blockquote>
<p>Following the tracked entries (and if requested), a series of lines will
be printed for untracked and then ignored items found in the worktree.</p>
<p>
Untracked items have the following format:</p>
<blockquote>
<pre class="example">
? &lt;path&gt;
</pre>
</blockquote>
<p>
Ignored items have the following format:</p>
<blockquote>
<pre class="example">
! &lt;path&gt;
</pre>
</blockquote>
</blockquote>
<p>
\\</p>
<p>
<strong>Pathname Format Notes and -z</strong></p>
<blockquote>
<p>When the <strong>-z</strong> option is given, pathnames are printed as is and without
any quoting and lines are terminated with a NUL (ASCII 0x00) byte.</p>
<p>
Without the <strong>-z</strong> option, pathnames with &#34;unusual&#34; characters are quoted
as explained for the configuration variable <strong>core.quotePath</strong> (see
*git-config*(1)).</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
CONFIGURATION
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>The command honors <strong>color.status</strong> (or <strong>status.color</strong> — they mean the
same thing and the latter is kept for backward compatibility) and
<strong>color.status.&lt;slot&gt;</strong> configuration variables to colorize its output.</p>
<p>
If the config variable <strong>status.relativePaths</strong> is set to false, then all
paths shown are relative to the repository root, not to the current
directory.</p>
<p>
If <strong>status.submoduleSummary</strong> is set to a non zero number or true
(identical to -1 or an unlimited number), the submodule summary will be
enabled for the long format and a summary of commits for modified
submodules will be shown (see –summary-limit option of
*git-submodule*(1)). Please note that the summary output from the status
command will be suppressed for all submodules when
<strong>diff.ignoreSubmodules</strong> is set to <em>all</em> or only for those submodules
where <strong>submodule.&lt;name&gt;.ignore=all</strong>. To also view the summary for
ignored submodules you can either use the –ignore-submodules=dirty
command line option or the <em>git submodule summary</em> command, which shows
a similar output but does not honor these settings.</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
BACKGROUND REFRESH
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>By default, <strong>git status</strong> will automatically refresh the index, updating
the cached stat information from the working tree and writing out the
result. Writing out the updated index is an optimization that isn&#39;t
strictly necessary (<strong>status</strong> computes the values for itself, but writing
them out is just to save subsequent programs from repeating our
computation). When <strong>status</strong> is run in the background, the lock held
during the write may conflict with other simultaneous processes, causing
them to fail. Scripts running <strong>status</strong> in the background should consider
using <strong>git –no-optional-locks status</strong> (see *git*(1) for details).</p>
</div>
</div>
