public/man/man1/git-status.1/index.html
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
UNTRACKED FILES AND PERFORMANCE
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p><strong>git status</strong> can be very slow in large worktrees if/when it needs to
search for untracked files and directories. There are many configuration
options available to speed this up by either avoiding the work or making
use of cached results from previous Git commands. There is no single
optimum set of settings right for everyone. We&#39;ll list a summary of the
relevant options to help you, but before going into the list, you may
want to run <strong>git status</strong> again, because your configuration may already
be caching <strong>git status</strong> results, so it could be faster on subsequent
runs.</p>
<blockquote>
<p>·</p>
<p>
The <strong>–untracked-files=no</strong> flag or the <strong>status.showUntrackedFiles=no</strong>
config (see above for both): indicate that <strong>git status</strong> should not
report untracked files. This is the fastest option. <strong>git status</strong> will
not list the untracked files, so you need to be careful to remember if
you create any new files and manually <strong>git add</strong> them.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>advice.statusUoption=false</strong> (see <strong>git-config*(1)): setting this
variable to *false</strong> disables the warning message given when enumerating
untracked files takes more than 2 seconds. In a large project, it may
take longer and the user may have already accepted the trade off (e.g.
using &#34;-uno&#34; may not be an acceptable option for the user), in which
case, there is no point issuing the warning message, and in such a case,
disabling the warning may be the best.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>core.untrackedCache=true</strong> (see *git-update-index*(1)): enable the
untracked cache feature and only search directories that have been
modified since the previous <strong>git status</strong> command. Git remembers the set
of untracked files within each directory and assumes that if a directory
has not been modified, then the set of untracked files within has not
changed. This is much faster than enumerating the contents of every
directory, but still not without cost, because Git still has to search
for the set of modified directories. The untracked cache is stored in
the <strong>.git/index</strong> file. The reduced cost of searching for untracked files
is offset slightly by the increased size of the index and the cost of
keeping it up-to-date. That reduced search time is usually worth the
additional size.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>core.untrackedCache=true</strong> and <strong>core.fsmonitor=true</strong> or
<strong>core.fsmonitor=&lt;hook-command-pathname&gt;</strong> (see *git-update-index*(1)):
enable both the untracked cache and FSMonitor features and only search
directories that have been modified since the previous <strong>git status</strong>
command. This is faster than using just the untracked cache alone
because Git can also avoid searching for modified directories. Git only
has to enumerate the exact set of directories that have changed
recently. While the FSMonitor feature can be enabled without the
untracked cache, the benefits are greatly reduced in that case.</p>
</blockquote>
<p>
Note that after you turn on the untracked cache and/or FSMonitor
features it may take a few <strong>git status</strong> commands for the various caches
to warm up before you see improved command times. This is normal.</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
SEE ALSO
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>*gitignore*(5)</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
GIT
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
